//自定义状态码映射表
const map = {
  800:'查询成功',
  801:'查询失败',
  802:'登录成功',
  803:'登录失败，用户不存在',
  804:'登录失败，密码错误',
  805:'无法获取登录状态',
  806:'登录状态已过期',
  807:'操作失败',
  808:'操作成功',
  809:'验证失败，用户名已存在',
  810:'验证成功，用户名可用',
  811:'上传失败，图片超过服务器要求的大小',
  812:'上传成功',
  813:'查询结果为空',
  814:'批量删除成功',
  815:'部分删除失败',
  816:'新建收藏夹失败，收藏夹已存在',
  817:'注册失败，用户名包含非法字符',
  818:'注册失败，用户名长度错误',
  819:'注册失败，用户名已存在',
  820:'注册成功',
  821:'未知错误，请检查代码',
  822:'SECRET_KEY验证失败，请向项目维护者索要最新的SECRET_KEY',
  823:'token验证失败',
  824:'跨域请求失败',
  825:'网络通信正常',
  826:'删除失败'
}

module.exports = map